Revit 2017 API
BuiltInFailures.AutoRouteFailures.AttemptToComnnectNonSlopingElementToSlopedPipeError Property
 You have specified that sloped pipe be drawn, but are trying to connect to an element that doesn't support sloping connections.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public static FailureDefinitionId AttemptToComnnectNonSlopingElementToSlopedPipeError { get; }
Visual Basic
Public Shared ReadOnly Property AttemptToComnnectNonSlopingElementToSlopedPipeError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ AttemptToComnnectNonSlopingElementToSlopedPipeError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace